Posts/2020-02-10-Markdown-Live-Preview-Without-Vim-Pluggins.org
#+TITLE:     Markdown Live Preview Without Vim Pluggins
#+AUTHOR:    Alexander Brown
#+EMAIL:     alex.brown7711@gmail.com
#+DATE: <2021-05-17 13:43>
#+DESCRIPTION: Preview markdown without pluggins in vim
#+KEYWORDS: Markdown Vim 
#+LANGUAGE:  en
#+OPTIONS:   H:5 num:nil toc:2 p:t

* Introduction
Markdown is an extremely quick and convenient way to jot down notes, draft up a quick styled paper, or even with the yaml metada block for pandoc markdown write a full paper. During college I went through a few markdown applications that auto-generated the markdown on the fly, managed your notes into a tree structure for you, or had auto complete commands. I even tried using Vim for a while, but gave up on it for a while. Recently I have rekindled my affinity for Vim because of work and decided to give note taking through Vim another shot. Needless to say that it went well because this post exists.

If you don't know the basics of Markdown, you can refer to [[https://www.markdownguide.org/getting-started][this link]]. Other than that, the configuration I will show you in this post utilizes: Linux, pandoc, Vim, and Zathura (or whatever other pdf tool you would like to use). Using these tools we will create a quick and easy way to compile your markdown files (which can also be extended to any file type), and view our formatted pdf document generated by our markdown file on the fly!

* pandoc
Very simply pandoc is a file converter. You can convert LaTeX files into html files, pdf files, or whatever other file type pandoc supports. This is a similar case to markdown. A typical conversion from markdown to pdf using pandoc would be:

#+begin_src shell
pandoc markdown.md -o pdf.pdf
#+end_src

Which takes a markdown file called "markdown" and creates a pdf file called "pdf".

* Compile Script
This is the glue that will make the compiling a breeze. Create a document called "compile" and insert the following code:

#+begin_src shell
#!/bin/sh

file=$(readlink -f "$1")
dir=$(dirname "$file")
base="${file%.*}"
shebang=$(sed -n 1p "$file")

cd "$dir" || exit

case "$file" in
    *.md) pandoc "$file" -o "$base".pdf;; 
esac
#+end_src

All this script does is when it is passed a file it will run a certain command based on the file extension. In this case it runs a pandoc command similar to the one shown above.

* Tying this all together with Vim
Now we want a quick and easy way to run this command and pass the file we are editing from Vim. Fortunately, this is easy enough! Copy the following command into your .vimrc:

#+begin_src vim
nnoremap <leader>c :silent execute '!~/[path]/[to]/[script]/compile %:p' <bar> :redraw! <Enter>
#+end_src

This command remaps "\\+c" to run the compile script and then pop you right back into Vim. To be able to view your pdf change as you compile it, you can open the pdf with zathura, or whatever is your favorite pdf viewer.
