2020-02-10-Markdown-Live-Preview-Without-Vim-Pluggins.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="description" content="Preview markdown without pluggins in vim">
<link rel="alternate"
      type="application/rss+xml"
      href="https://alexb7711.github.io/rss.xml"
      title="RSS feed for https://alexb7711.github.io">
<title>Markdown Live Preview Without Vim Pluggins</title>
<meta name="author" content="Alex Brown">
<meta name="referrer" content="no-referrer">
<link href= "Theme/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="~/Videos/StreamingAssets/Profile.png"></head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="https://alexb7711.github.io">Created with Emacs</a>
</div></div>
<div id="content">
<div class="post-date">17 May 2021</div><h1 class="post-title"><a href="https://alexb7711.github.io/2020-02-10-Markdown-Live-Preview-Without-Vim-Pluggins.html">Markdown Live Preview Without Vim Pluggins</a></h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9c0c113">Introduction</a></li>
<li><a href="#org13a34bb">pandoc</a></li>
<li><a href="#orgae038e6">Compile Script</a></li>
<li><a href="#org4a8433c">Tying this all together with Vim</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org9c0c113" class="outline-2">
<h2 id="org9c0c113">Introduction</h2>
<div class="outline-text-2" id="text-org9c0c113">
<p>
Markdown is an extremely quick and convenient way to jot down notes, draft up a quick styled paper, or even with the yaml metada block for pandoc markdown write a full paper. During college I went through a few markdown applications that auto-generated the markdown on the fly, managed your notes into a tree structure for you, or had auto complete commands. I even tried using Vim for a while, but gave up on it for a while. Recently I have rekindled my affinity for Vim because of work and decided to give note taking through Vim another shot. Needless to say that it went well because this post exists.
</p>

<p>
If you don&rsquo;t know the basics of Markdown, you can refer to <a href="https://www.markdownguide.org/getting-started">this link</a>. Other than that, the configuration I will show you in this post utilizes: Linux, pandoc, Vim, and Zathura (or whatever other pdf tool you would like to use). Using these tools we will create a quick and easy way to compile your markdown files (which can also be extended to any file type), and view our formatted pdf document generated by our markdown file on the fly!
</p>
</div>
</div>

<div id="outline-container-org13a34bb" class="outline-2">
<h2 id="org13a34bb">pandoc</h2>
<div class="outline-text-2" id="text-org13a34bb">
<p>
Very simply pandoc is a file converter. You can convert LaTeX files into html files, pdf files, or whatever other file type pandoc supports. This is a similar case to markdown. A typical conversion from markdown to pdf using pandoc would be:
</p>

<div class="org-src-container">
<pre class="src src-shell">pandoc markdown.md -o pdf.pdf
</pre>
</div>

<p>
Which takes a markdown file called &ldquo;markdown&rdquo; and creates a pdf file called &ldquo;pdf&rdquo;.
</p>
</div>
</div>

<div id="outline-container-orgae038e6" class="outline-2">
<h2 id="orgae038e6">Compile Script</h2>
<div class="outline-text-2" id="text-orgae038e6">
<p>
This is the glue that will make the compiling a breeze. Create a document called &ldquo;compile&rdquo; and insert the following code:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ffff00;">#</span><span style="color: #ffff00;">!/bin/</span><span style="color: #00ffff; font-weight: bold;">sh</span>

<span style="color: #ffff00;">file</span>=$<span style="color: #8c8c8c;">(</span>readlink -f <span style="color: #00ff00;">"</span><span style="color: #ff00ff;">$</span><span style="color: #ffff00;">1</span><span style="color: #00ff00;">"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #ffff00;">dir</span>=$<span style="color: #8c8c8c;">(</span>dirname <span style="color: #00ff00;">"</span><span style="color: #ff00ff;">$</span><span style="color: #ffff00;">file</span><span style="color: #00ff00;">"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #ffff00;">base</span>=<span style="color: #00ff00;">"</span><span style="color: #ff00ff;">$</span><span style="color: #ffff00;">{file%.*}</span><span style="color: #00ff00;">"</span>
<span style="color: #ffff00;">shebang</span>=$<span style="color: #8c8c8c;">(</span>sed -n 1p <span style="color: #00ff00;">"</span><span style="color: #ff00ff;">$</span><span style="color: #ffff00;">file</span><span style="color: #00ff00;">"</span><span style="color: #8c8c8c;">)</span>

<span style="color: #00ff00;">cd</span> <span style="color: #00ff00;">"</span><span style="color: #ff00ff;">$</span><span style="color: #ffff00;">dir</span><span style="color: #00ff00;">"</span> || <span style="color: #00ffff; font-weight: bold;">exit</span>

<span style="color: #00ffff; font-weight: bold;">case</span> <span style="color: #00ff00;">"</span><span style="color: #ff00ff;">$</span><span style="color: #ffff00;">file</span><span style="color: #00ff00;">"</span><span style="color: #00ffff; font-weight: bold;"> in</span>
    *.md) pandoc <span style="color: #00ff00;">"</span><span style="color: #ff00ff;">$</span><span style="color: #ffff00;">file</span><span style="color: #00ff00;">"</span> -o <span style="color: #00ff00;">"</span><span style="color: #ff00ff;">$</span><span style="color: #ffff00;">base</span><span style="color: #00ff00;">"</span>.pdf;;
<span style="color: #00ffff; font-weight: bold;">esac</span>
</pre>
</div>

<p>
All this script does is when it is passed a file it will run a certain command based on the file extension. In this case it runs a pandoc command similar to the one shown above.
</p>
</div>
</div>

<div id="outline-container-org4a8433c" class="outline-2">
<h2 id="org4a8433c">Tying this all together with Vim</h2>
<div class="outline-text-2" id="text-org4a8433c">
<p>
Now we want a quick and easy way to run this command and pass the file we are editing from Vim. Fortunately, this is easy enough! Copy the following command into your .vimrc:
</p>

<div class="org-src-container">
<pre class="src src-vim">nnoremap &lt;leader&gt;c :silent execute '!~/[path]/[to]/[script]/compile %:p' &lt;bar&gt; :redraw! &lt;Enter&gt;
</pre>
</div>

<p>
This command remaps &ldquo;\\+c&rdquo; to run the compile script and then pop you right back into Vim. To be able to view your pdf change as you compile it, you can open the pdf with zathura, or whatever is your favorite pdf viewer.
</p>
</div>
</div>
<div class="taglist"></div></div>
<div id="postamble" class="status"><div id="archive">
  <a href="https://alexb7711.github.io/archive.html">Other posts</a>
</div></div>
</body>
</html>
